## How to Handle Excel File

In [3]:
import pandas as pd

In [19]:
df =pd.read_excel(r"C:\Users\syam0\Downloads\Saniya Mastan\d1.xlsx")
df

  Name  Age
0   p1   21
1   p2   24
2   p3   26
3   p4   23

In [9]:
pd.read_excel(r"C:\Users\syam0\Downloads\Saniya Mastan\d1.xlsx",sheet_name =1)

   maths  Hindi
0     12    324
1     12    324
2     12    324
3     12    324

In [11]:
pd.read_excel(r"C:\Users\syam0\Downloads\Saniya Mastan\d1.xlsx",sheet_name =2)

   maths  Hindi
0     13    325
1     13    325
2     13    325
3     13    325

In [29]:
df =pd.read_excel(r"C:\Users\syam0\Downloads\Saniya Mastan\d1.xlsx",sheet_name=[0,1,2])
df

{0:   Name  Age
 0   p1   21
 1   p2   24
 2   p3   26
 3   p4   23,
 1:    maths  Hindi
 0     12    324
 1     12    324
 2     12    324
 3     12    324,
 2:    maths  Hindi
 0     13    325
 1     13    325
 2     13    325
 3     13    325}

In [33]:
df[0].to_excel(r"C:\Users\syam0\Downloads\Saniya Mastan\d12.xlsx")

In [35]:
df[0]

  Name  Age
0   p1   21
1   p2   24
2   p3   26
3   p4   23

In [37]:
df[1].to_excel(r"C:\Users\syam0\Downloads\Saniya Mastan\d12.xlsx")

In [39]:
df[1]

   maths  Hindi
0     12    324
1     12    324
2     12    324
3     12    324

In [41]:
df[2].to_excel(r"C:\Users\syam0\Downloads\Saniya Mastan\d12.xlsx")

In [43]:
df[2]

   maths  Hindi
0     13    325
1     13    325
2     13    325
3     13    325

In [53]:
## Multiple dataframe into excel sheets

In [49]:
with pd.ExcelWriter(r"C:\Users\syam0\Downloads\Saniya Mastan\d122.xlsx") as f:       ## mode x
    df[0].to_excel(f,sheet_name ="student_info")
    df[1].to_excel(f,sheet_name ="sem1")
    df[2].to_excel(f,sheet_name ="sem2")

PermissionError: [Errno 13] Permission denied: 'C:\\Users\\syam0\\Downloads\\Saniya Mastan\\d122.xlsx'

## How to Handle JSON File

In [74]:
x = '{"Name":["p1","p2"],"Age":[21,23]}'
## default json format simplest json

In [57]:
pd.read_json(x)

C:\Users\syam0\AppData\Local\Temp\ipykernel_6164\1267235832.py:1: FutureWarning: Passing literal json to 'read_json' is deprecated and will be removed in a future version. To read from a literal string, wrap it in a 'StringIO' object.
  pd.read_json(x)

  Name  Age
0   p1   21
1   p2   23

In [63]:
x = '{1:["p1","p2"],"Age":[21,23]}'   ## keys only take string datatype
                                      ## Can't use int,float,complex etc only strings

In [61]:
pd.read_json(x)

C:\Users\syam0\AppData\Local\Temp\ipykernel_6164\1267235832.py:1: FutureWarning: Passing literal json to 'read_json' is deprecated and will be removed in a future version. To read from a literal string, wrap it in a 'StringIO' object.
  pd.read_json(x)

ValueError: Key name of object must be 'string' when decoding 'object'

simplest form of json is

where keys --   acting as column names

where values --- acting as column values

x = '{"Name":["p1","p2"],"Age":[21,23]}'

### Different formats of json

In [76]:
data =  '{"Name":["p1","p2"],"Age":[21,23]}'

In [78]:
data=pd.read_json(x)

C:\Users\syam0\AppData\Local\Temp\ipykernel_6164\1694729012.py:1: FutureWarning: Passing literal json to 'read_json' is deprecated and will be removed in a future version. To read from a literal string, wrap it in a 'StringIO' object.
  data=pd.read_json(x)

In [80]:
data

  Name  Age
0   p1   21
1   p2   23

In [86]:
x2=data.to_json(orient="index")

In [88]:
x2

'{"0":{"Name":"p1","Age":21},"1":{"Name":"p2","Age":23}}'

In [98]:
pd.read_json(x2,orient="index")

C:\Users\syam0\AppData\Local\Temp\ipykernel_6164\1222398037.py:1: FutureWarning: Passing literal json to 'read_json' is deprecated and will be removed in a future version. To read from a literal string, wrap it in a 'StringIO' object.
  pd.read_json(x2,orient="index")

  Name  Age
0   p1   21
1   p2   23

In [92]:
x3 =data.to_json(orient="columns")

In [94]:
x3

'{"Name":{"0":"p1","1":"p2"},"Age":{"0":21,"1":23}}'

In [96]:
pd.read_json(x3,orient="columns")

C:\Users\syam0\AppData\Local\Temp\ipykernel_6164\2742886167.py:1: FutureWarning: Passing literal json to 'read_json' is deprecated and will be removed in a future version. To read from a literal string, wrap it in a 'StringIO' object.
  pd.read_json(x3,orient="columns")

  Name  Age
0   p1   21
1   p2   23

In [100]:
x4 = data.to_json(orient="values")

In [102]:
x4

'[["p1",21],["p2",23]]'

In [104]:
pd.read_json(x4,orient="values")

C:\Users\syam0\AppData\Local\Temp\ipykernel_6164\2664431613.py:1: FutureWarning: Passing literal json to 'read_json' is deprecated and will be removed in a future version. To read from a literal string, wrap it in a 'StringIO' object.
  pd.read_json(x4,orient="values")

    0   1
0  p1  21
1  p2  23

In [106]:
x5=data.to_json(orient="split")

In [108]:
x5

'{"columns":["Name","Age"],"index":[0,1],"data":[["p1",21],["p2",23]]}'

In [110]:
pd.read_json(x5,orient="split")

C:\Users\syam0\AppData\Local\Temp\ipykernel_6164\426387458.py:1: FutureWarning: Passing literal json to 'read_json' is deprecated and will be removed in a future version. To read from a literal string, wrap it in a 'StringIO' object.
  pd.read_json(x5,orient="split")

  Name  Age
0   p1   21
1   p2   23

### Semi-Structured Json file

In [143]:
x =  {"Name":"p1","marks":21} #semi_structure takes the format in dictionary
                            # whereas structured json takes the format in string

In [121]:
x

{'Name': 'p1', 'marks': 21}

In [123]:
type(x)

dict

In [125]:
x =  {"Name":"p1","marks":{"Maths":21,"Hindi":20}}

In [127]:
pd.json_normalize(x)

  Name  marks.Maths  marks.Hindi
0   p1           21           20

In [129]:
x =  {"Name":"p1","marks":{"Sem1":{"Maths":21,"Hindi":20},"Sem2":{"Maths":22,"Hindi":25}}}

In [131]:
pd.json_normalize(x)

  Name  marks.Sem1.Maths  marks.Sem1.Hindi  marks.Sem2.Maths  marks.Sem2.Hindi
0   p1                21                20                22                25

In [135]:
pd.json_normalize(x,max_level=0)

  Name                                              marks
0   p1  {'Sem1': {'Maths': 21, 'Hindi': 20}, 'Sem2': {...

In [137]:
pd.json_normalize(x,max_level=1)

  Name                  marks.Sem1                  marks.Sem2
0   p1  {'Maths': 21, 'Hindi': 20}  {'Maths': 22, 'Hindi': 25}

In [139]:
pd.json_normalize(x,max_level=2)

  Name  marks.Sem1.Maths  marks.Sem1.Hindi  marks.Sem2.Maths  marks.Sem2.Hindi
0   p1                21                20                22                25

In [197]:
x =  {"Name":"p1","marks":[{"Sem1":20,"Sem2":30}],"Age":39}
## most occuring formst of semi-structured data

In [211]:
pd.json_normalize(x,record_path=["marks"],meta=[["Name","p1"],"Age"])

   Sem1  Sem2 Name.p1              Age
0    20    30      12  {'a': {'b': 1}}

In [203]:
x =  {"Name":{"p1":12},"marks":[{"Sem1":20,"Sem2":30}],"Age":{"a":{"b":1}}}

In [213]:
pd.json_normalize(x,record_path=["marks"],meta=[["Name","p1"],["Age","a","b"]])

   Sem1  Sem2 Name.p1 Age.a.b
0    20    30      12       1